// Заполняет расширфровку поступления на РС
// Объект - документ поступления на РС
Процедура АвтоЗаполнитьРасшифровку(Объект)Экспорт	
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДокЗаявка.Дата КАК Дата,
		|	ДокЗаявка.Ссылка КАК Заявка,
		|	// ДокЗаявка.СуммаДокумента - ЕСТЬNULL(ОплатаЗаявокОбороты.СуммаОборот, 0) КАК Остаток
		|	ЕСТЬNull(ВзаиморасчетыОстатки.СуммаОстаток,0) КАК Остаток
		|ИЗ
		|	Документ.Заявка КАК ДокЗаявка    
		|    ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Взаиморасчеты.Остатки КАК ВзаиморасчетыОстатки
		|    	ПО ДокЗаявка.Ссылка = ВзаиморасчетыОстатки.Заявка
		|		//ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОплатаЗаявок.Обороты КАК ОплатаЗаявокОбороты
		|		// ПО (ОплатаЗаявокОбороты.Заявка = ДокЗаявка.Ссылка)
		|ГДЕ
		|	НЕ ДокЗаявка.ПометкаУдаления
		|	И ВЫБОР
		|			КОГДА ДокЗаявка.Плательщик = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		|				ТОГДА ДокЗаявка.Контрагент
		|			ИНАЧЕ ДокЗаявка.Плательщик
		|		КОНЕЦ = &Контрагент
		|	И ЕСТЬNull(ВзаиморасчетыОстатки.СуммаОстаток,0)  > 0
		|	И ДокЗаявка.Дата >= &ПервоеАпреля
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата";
		Запрос.УстановитьПараметр("ПервоеАпреля", '20220401');   
		Запрос.УстановитьПараметр("Контрагент", Объект.Контрагент);
		
		Осталось = Объект.СуммаДокумента;
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Если Осталось = 0 Тогда
				Прервать;
			КонецЕсли;
			Закрыть = Мин(Осталось, Выборка.Остаток); 
			Если Закрыть > 0 Тогда
				СтрРП = Объект.РасшифровкаПлатежа.Добавить();
				СтрРП.Заявка = Выборка.Заявка;
				СтрРП.Сумма = Закрыть;
				Осталось = Осталось - Закрыть; 
			КонецЕсли;
		КонецЦикла;
		Если Осталось > 0 Тогда
			СтрРП = Объект.РасшифровкаПлатежа.Добавить();
			СтрРП.Сумма = Осталось;
		КонецЕсли;
		
КонецПроцедуры