

&НаКлиенте
Процедура НомерБланкаНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
		Элементы.НомерБланка.СписокВыбора.ЗагрузитьЗначения(ЭкспертизаИСертификация.ВернутьСписокНомеровБланков(ВидСертификата,Организация,Эксперт));
	
	
	
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	если параметры.ДанныеСертификата.ПолныйНомер="" тогда Отказ=истина; конецесли;
	
	ЗаполнитьЗначенияСвойств(этаформа,параметры.ДанныеСертификата);	
	
	ЭкспертизаИСертификация.ЗаполнитьТЧИзМассиваСтруктур(тнвед,параметры.ТаблицаСертификата,Неопределено);
	
	СтруктураДанныхСертификатов = Новый Структура();
	
	Для каждого Элемент Из параметры.ДанныеСертификата Цикл
		СтруктураДанныхСертификатов.Вставить(Элемент.Ключ);
	КонецЦикла;
	
	
	
	
	//Для Каждого ии из тнвед цикл
	//	ии.нп=тнвед.индекс(ии)+1;
	//	
	//КонецЦикла;
	
	

Если ОтправленВТТПРФ Тогда    ЭтаФорма.Доступность=ложь;  	КонецЕсли;
	Если Статус=Перечисления.СтатусыСертификатов._9  Тогда    ЭтаФорма.Доступность=ложь;  	КонецЕсли;




///////////////////////////////////////////Параметры формы сертификата////////////////////////////////////

Если не ЗначениеЗаполнено(Статус) тогда
	 статус=Перечисления.СтатусыСертификатов._6;
	
КонецЕсли;

	РеквизитПодбораТНВЕД="НаименованиеРусское";
	
	Элементы.КнопкаТНВЕДПодбор.Видимость=истина;
	
	Если   НомерБланка>0   тогда
		
		Элементы.НомерБланка.СписокВыбора.Добавить(НомерБланка);
		//Элементы.НомерБланка.Доступность=не ЭкспертизаСертификацияПИ.ПолучитьЗапретНаСменуНомеровБланковПослеВыбора();
	КонецЕсли;
	
	Если Статус<>Перечисления.СтатусыСертификатов._6  Тогда 
	элементы.НомерБланка.Доступность=ложь;
	иначе
	элементы.НомерБланка.Доступность=истина;
	конецесли;

	если не значениезаполнено(Подписант) Тогда
	Подписант=справочники.Пользователи.НайтиПоНаименованию("Смоленко И");
    конецесли;
	
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)
	
	
	ЗаполнитьЗначенияСвойств(СтруктураДанныхСертификатов,Этаформа)  ;
	ЭтаФорма.Закрыть(новый структура("Команда,ДанныеСертификата,Таблица","ок",СтруктураДанныхСертификатов,ЭкспертизаИСертификация.ТЧВМасивструктур(тнвед)));

	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	ЭтаФорма.Закрыть(новый структура("Команда","отмена"));
КонецПроцедуры


&НаКлиенте
Процедура ТНВЕДПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
элемент.ТекущиеДанные.ид=ид;	
элемент.ТекущиеДанные.нп=тнвед.индекс(элемент.ТекущиеДанные)+1;

КонецПроцедуры


&НаКлиенте
Процедура Подбор(Команда)
	ЗначениеОтбора = Новый Структура();
 //   ЗначениеОтбора.Вставить("Организация", Организация);
    ПараметрыВыбора = Новый Структура("ЗакрыватьПриВыборе, МножественныйВыбор, Отбор", Истина, Истина, ЗначениеОтбора);
    
    Оповещение = новый ОписаниеОповещения("ОбработатьПодборТнвед",ЭтаФорма);
    
    ОткрытьФорму("Справочник.КлассификаторТНВЭД.ФормаВыбора",ПараметрыВыбора,ЭтаФорма,,,,Оповещение);  //

КонецПроцедуры


&НаКлиенте
Процедура ОбработатьПодборТнвед(Рез,ДопПараметры) Экспорт
	Если рез=Неопределено тогда
		возврат;
	конецесли;
	для каждого ии из рез цикл
		стр=тнвед.Добавить();
		стр.ид=ид;
		стр.товар=ЭкспертизаИСертификация.ЗначениеРеквизитаОбъекта(ии,РеквизитПодбораТНВЕД);
		
	конеццикла;
	
	

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	//Вставить содержимое обработчика
КонецПроцедуры

&НаСервере
Процедура УстановитьСтусПроектНаСервере()

статус=Перечисления.СтатусыСертификатов._6;
	
КонецПроцедуры
	
&НаКлиенте
Процедура СтатусПриИзменении(Элемент)
	
	если Элемент.ТекстРедактирования<>"6   - проект"  тогда
	элементы.НомерБланка.Доступность=ложь;
	иначе
	элементы.НомерБланка.Доступность=истина;
	конецесли;
	
	 если Элемент.ТекстРедактирования="9   - аннулирован"  тогда
     УстановитьСтусПроектНаСервере();
     конецесли;
	 
	Если   НомерБланка=0   тогда
	УстановитьСтусПроектНаСервере();
	КонецЕсли;
	 
	 
КонецПроцедуры
