
&НаКлиенте
Процедура КонечныйНомерПриИзменении(Элемент)
	
	объект_ВсегоБланков=объект.КонечныйНомер-объект.НачальныйНомер+1;
	
	если  объект_ВсегоБланков>100 тогда
		объект.КонечныйНомер=0;   
		объект.ВсегоБланков=0;   
	иначе   
		
		объект.ВсегоБланков=объект_ВсегоБланков;
		
	конецесли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура НачальныйНомерПриИзменении(Элемент)
	
	объект_ВсегоБланков=объект.КонечныйНомер-объект.НачальныйНомер+1;
	
	если  объект_ВсегоБланков>100 тогда
		объект.НачальныйНомер=0;   
		объект.ВсегоБланков=0;   
	иначе   
		
		объект.ВсегоБланков=объект_ВсегоБланков;
		
	конецесли;
	
	ПроверитьНачальныйНомерПриИзменении();	 
	
	//объект.ВсегоБланков=объект.КонечныйНомер-объект.НачальныйНомер+1;
КонецПроцедуры


&НаСервере
Процедура ПроверитьНачальныйНомерПриИзменении()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НомераБланков.Номер КАК Номер,
	|	НомераБланков.ВидСертификата КАК ВидСертификата
	|ИЗ
	|	РегистрСведений.НомераБланков КАК НомераБланков
	|ГДЕ
	|	НомераБланков.Номер = &Номер
	|	И НомераБланков.ВидСертификата = &ВидСертификата";
	
	Запрос.УстановитьПараметр("ВидСертификата", объект.ВидБланка);
	Запрос.УстановитьПараметр("Номер", объект.НачальныйНомер);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	если Выборка.Следующий() тогда
		
		объект.НачальныйНомер=0;   
		объект.ВсегоБланков=0;   
		сообщить("существует");
		
	Конецесли;
	
конецПроцедуры
