
&НаСервереБезКонтекста
Процедура УдалитьВсехКотрагентовНаСервере()
	
	
	  выб=справочники.Контрагенты.Выбрать();
	  Пока выб.Следующий() цикл
		  выб.ПолучитьОбъект().Удалить();
		  
	  КонецЦикла;
	  
	
	
	
	
	
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьВсехКотрагентов(Команда)
	УдалитьВсехКотрагентовНаСервере();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УдалитьВсюНоменклатуруНаСервере()
		  выб=справочники.Номенклатура.Выбрать();
	  Пока выб.Следующий() цикл
		  выб.ПолучитьОбъект().Удалить();
		  
	  КонецЦикла;

	
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьВсюНоменклатуру(Команда)
	УдалитьВсюНоменклатуруНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьНоменклатуруНаСервере()
	
	      ЭтотОтчет = РеквизитФормыВЗначение("Объект");
    Макет = ЭтотОтчет.ПолучитьМакет("Номенклатура");
	
	НачинатьССтроки=2;
	
	тд=Макет;
	
	ии=НачинатьССтроки;
	текгруппа="";
	Пока истина цикл
		
		пометка=  тд.Область(ии,1,ии,1).Текст  ;
			Если  пометка=""  тогда
			Прервать;
		Конецесли ;
		Если  пометка="истина"  тогда
			ии=ии+1;
			Продолжить;;
		Конецесли ;
		
		
		
		этогруппа=тд.Область(ии,1,ии,1).ЦветФона.Вид=ВидЦвета.Абсолютный;
		
		
		Если этогруппа тогда
			спр=Справочники.Номенклатура.СоздатьГруппу();
			спр.Наименование=тд.Область(ии,3,ии,3).Текст ;
			спр.код=тд.Область(ии,2,ии,2).Текст ;

			спр.ОбменДанными.Загрузка=истина;
			спр.Записать();
			текгруппа=спр.Ссылка;

		иначе
			 спр=Справочники.Номенклатура.Создатьэлемент();
			 спр.Наименование=тд.Область(ии,3,ии,3).Текст ;
			спр.код=тд.Область(ии,2,ии,2).Текст ;

			спр.Родитель=текгруппа;
			спр.ПолнНаименование=тд.Область(ии,4,ии,4).Текст; 
			спр.Цена=тд.Область(ии,6,ии,6).Текст ;
			
			спр.ОбменДанными.Загрузка=истина;
			спр.Записать();
 
			 
			 
			 
			 

		КонецЕсли;
		
		
			 		
		
		
	
	
	      ии=ии+1;
	  КонецЦикла;
	  
	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьНоменклатуру(Команда)
	ЗагрузитьНоменклатуруНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьКонтрагентовНаСервере()
	  ЭтотОтчет = РеквизитФормыВЗначение("Объект");
    Макет = ЭтотОтчет.ПолучитьМакет("Контрагенты");
	
	НачинатьССтроки=2;
	
	тд=Макет;
	
	ии=НачинатьССтроки;
	текгруппа="";
	Пока истина цикл
		
		пометка=  тд.Область(ии,1,ии,1).Текст  ;
			Если  пометка=""  тогда
			Прервать;
		Конецесли ;
		Если  пометка="истина"  тогда
			ии=ии+1;
			Продолжить;;
		Конецесли ;
		
		
		
		этогруппа=тд.Область(ии,1,ии,1).ЦветФона.Вид=ВидЦвета.Абсолютный;
		
		
		Если этогруппа тогда
			спр=Справочники.Контрагенты.СоздатьГруппу();
			спр.Наименование=тд.Область(ии,3,ии,3).Текст ;
			спр.код=тд.Область(ии,2,ии,2).Текст ;

			спр.ОбменДанными.Загрузка=истина;
			спр.Записать();
			текгруппа=спр.Ссылка;

		иначе
			 спр=Справочники.Контрагенты.Создатьэлемент();
			 спр.Наименование=тд.Область(ии,3,ии,3).Текст ;
			спр.код=тд.Область(ии,2,ии,2).Текст ;

			спр.Родитель=текгруппа;
			спр.НаименованиеПолное=тд.Область(ии,5,ии,5).Текст; 
			спр.ВидКонтрагента=?(тд.Область(ии,4,ии,4).Текст="Физ. лицо",Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо ,Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо ) ;
			инн=тд.Область(ии,9,ии,9).Текст ;
			разд=СтрНайти(инн,"/")+СтрНайти(инн,"\")  ;
			если разд>0 тогда
				спр.инн=лев(инн,разд-1);
				спр.кпп=сред(инн,разд+1);
			иначе
				спр.инн=инн;

			КонецЕсли;
			 спр.КодПоОКПО=тд.Область(ии,14,ии,14).Текст ;
			спр.ОГРН  =  тд.Область(ии,17,ии,17).Текст  ;
			спр.ОКВЭД=  тд.Область(ии,20,ии,20).Текст  ;
			спр.Комментарий=  тд.Область(ии,19,ии,19).Текст  ;
			
			спр.ДолжностьЗаказчика  =   тд.Область(ии,15,ии,15).Текст  ;

			спр.ФИОЗаказчика=  тд.Область(ии,16,ии,16).Текст  ;

			спр.ДействуетНаОсновании= тд.Область(ии,21,ии,21).Текст  ;
			
			
			
			спр.ДокументСерия =    тд.Область(ии,10,ии,10).Текст  ;

			спр.ДокументНомер =     тд.Область(ии,11,ии,11).Текст  ;

			спр.ДокументДатаВыдачи  =   тд.Область(ии,13,ии,13).Текст  ;

			спр.ДокументКемВыдан   =тд.Область(ии,12,ии,12).Текст  ;


			
			
			
			строк= тд.Область(ии,6,ии,6).Текст  ;

			Если не ПустаяСтрока(строк) тогда
				
				стрк=спр.КонтактнаяИнформация.Добавить();
				стрк.тип=Перечисления.ТипыКонтактнойИнформации.Адрес;
				стрк.вид=Справочники.ВидыКонтактнойИнформации.АдресКонтрагента;
				стрк.Представление=строк;
				
				
			КонецЕсли;
			

			
			строк= тд.Область(ии,7,ии,7).Текст  ;

			Если не ПустаяСтрока(строк) тогда
				
				стрк=спр.КонтактнаяИнформация.Добавить();
				стрк.тип=Перечисления.ТипыКонтактнойИнформации.Адрес;
				стрк.вид=Справочники.ВидыКонтактнойИнформации.ФактическийАдресКонтрагента;
				стрк.Представление=строк;
				
				
			КонецЕсли;
			
				строк= тд.Область(ии,8,ии,8).Текст  ;

			Если не ПустаяСтрока(строк) тогда
				
				стрк=спр.КонтактнаяИнформация.Добавить();
				стрк.тип=Перечисления.ТипыКонтактнойИнформации.Телефон;
				стрк.вид=Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента;
				стрк.Представление=строк;
				стрк.НомерТелефона=строк;

				
			КонецЕсли;


			
			
					  строк= тд.Область(ии,18,ии,18).Текст  ;

		Если не ПустаяСтрока(стрк) тогда
				
				стрк=спр.КонтактнаяИнформация.Добавить();
				стрк.тип=Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
				стрк.вид=Справочники.ВидыКонтактнойИнформации.EmailКонтрагента;
				стрк.Представление=строк;
				стрк.АдресЭП=строк;

				
		КонецЕсли;

			
			
			
			
			
			спр.ОбменДанными.Загрузка=истина;
			спр.Записать();
 
			 
			 
			 
			 

		КонецЕсли;
		
		
			 		
		
		
	
	
	      ии=ии+1;
	  КонецЦикла;
	  
	

КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьКонтрагентов(Команда)
	ЗагрузитьКонтрагентовНаСервере();
КонецПроцедуры
