&НаСервере
Процедура ВидимостьДоступность()
	
	Если Режим = "Многострочный" Тогда
		Элементы.СтраницыРасшифровки.ТекущаяСтраница = Элементы.СтраницаМногострочный;
	Иначе
		Элементы.СтраницыРасшифровки.ТекущаяСтраница = Элементы.СтраницаОднострочный;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияРазбитьПлатежНажатие(Элемент)
	
	Режим = "Многострочный";
	ВидимостьДоступность();
		
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Объект.РасшифровкаПлатежа.Количество()>2 Тогда
		Режим = "Многострочный";
	Иначе
		Режим = "Однострочный";
	КонецЕсли;
	ВидимостьДоступность();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если Режим = "Однострочный" Тогда
		ТекущийОбъект.РасшифровкаПлатежа.Очистить();
		НовРП = ТекущийОбъект.РасшифровкаПлатежа.Добавить();
		НовРП.Заявка = ТекущийОбъект.Заявка;
		НовРП.Сумма = ТекущийОбъект.СуммаДокумента;
	Иначе
		ТекущийОбъект.СуммаДокумента = ТекущийОбъект.РасшифровкаПлатежа.Итог("Сумма");
	КонецЕсли;	
	
КонецПроцедуры
