///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2019, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	МожноРедактировать = ПравоДоступа("Редактирование", Метаданные.Справочники.Номенклатура);
	
	// СтандартныеПодсистемы.ГрупповоеИзменениеОбъектов
	//Элементы.ФормаИзменитьВыделенные.Видимость = МожноРедактировать;
	//Элементы.СписокКонтекстноеМенюИзменитьВыделенные.Видимость = МожноРедактировать;
	Элементы.ФормаИзменитьВыделенные.Видимость = ложь;
	Элементы.СписокКонтекстноеМенюИзменитьВыделенные.Видимость = ложь;
	// Конец СтандартныеПодсистемы.ГрупповоеИзменениеОбъектов
	
	// СтандартныеПодсистемы.ПоискИУдалениеДублей
	Элементы.ФормаОбъединитьВыделенные.Видимость = МожноРедактировать;
	Элементы.СписокКонтекстноеМенюОбъединитьВыделенные.Видимость = МожноРедактировать;
	Элементы.ФормаЗаменитьИУдалить.Видимость = МожноРедактировать;
	Элементы.СписокКонтекстноеМенюЗаменитьИУдалить.Видимость = МожноРедактировать;
	Элементы.ФормаПоказатьМестаИспользования.Видимость = МожноРедактировать;
	// Конец СтандартныеПодсистемы.ПоискИУдалениеДублей
	
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	

КонецПроцедуры

&НаСервереБезКонтекста
Процедура СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ГрупповоеИзменениеОбъектов

&НаКлиенте
Процедура ИзменитьВыделенные(Команда)
	
	ГрупповоеИзменениеОбъектовКлиент.ИзменитьВыделенные(Элементы.Список);
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ГрупповоеИзменениеОбъектов


// СтандартныеПодсистемы.ПоискИУдалениеДублей

&НаКлиенте
Процедура ОбъединитьВыделенные(Команда)
	
	ПоискИУдалениеДублейКлиент.ОбъединитьВыделенные(Элементы.Список);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьМестаИспользования(Команда)
	
	ПоискИУдалениеДублейКлиент.ПоказатьМестаИспользования(Элементы.Список);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаменитьИУдалить(Команда)
    
    
      
	ПоискИУдалениеДублейКлиент.ЗаменитьВыделенные(Элементы.Список);
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ПоискИУдалениеДублей

#КонецОбласти
