
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Ответственный = Пользователи.ТекущийПользователь();
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	//Движения.ОплатаЗаявок.Записывать = Истина;
	//// регистр ОплатаЗаявок 
	//Для Каждого СтрокаРП Из РасшифровкаПлатежа Цикл
	//	Движение = Движения.ОплатаЗаявок.Добавить();
	//	Движение.Период = Дата;
	//	Движение.Заявка = СтрокаРП.Заявка;
	//	Движение.Контрагент = Контрагент;
	//	Движение.Договор = Договор;
	//	Движение.Сумма = СтрокаРП.Сумма;
	//КонецЦикла;

КонецПроцедуры
