

&НаКлиенте
Процедура НомерБланкаНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
		Элементы.НомерБланка.СписокВыбора.ЗагрузитьЗначения(ЭкспертизаИСертификация.ВернутьСписокНомеровБланков(ВидСертификата,Организация,Эксперт));
	
	
	
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	если параметры.ДанныеСертификата.ПолныйНомер="" тогда Отказ=истина; конецесли;
	
	ЗаполнитьЗначенияСвойств(этаформа,параметры.ДанныеСертификата);	
	
	ЭкспертизаИСертификация.ЗаполнитьТЧИзМассиваСтруктур(тнвед,параметры.ТаблицаСертификата,Неопределено);
	
	СтруктураДанныхСертификатов = Новый Структура();
	
	Для каждого Элемент Из параметры.ДанныеСертификата Цикл
		СтруктураДанныхСертификатов.Вставить(Элемент.Ключ);
	КонецЦикла;
	
	
	Если ОтправленВТТПРФ Тогда    ЭтаФорма.Доступность=ложь;  	КонецЕсли;
	Если Статус=Перечисления.СтатусыСертификатов._9  Тогда    ЭтаФорма.Доступность=ложь;  	КонецЕсли;


///////////////////////////////////////////Параметры формы сертификата////////////////////////////////////

Если не ЗначениеЗаполнено(Статус) тогда
	 статус=Перечисления.СтатусыСертификатов._6;
	
КонецЕсли;

	РеквизитПодбораТНВЕД="НаименованиеРусское";
	
	Элементы.КнопкаТНВЕДПодбор.Видимость=истина;
	
	Если   НомерБланка>0   тогда
		
		Элементы.НомерБланка.СписокВыбора.Добавить(НомерБланка);
		//Элементы.НомерБланка.Доступность=не ЭкспертизаСертификацияПИ.ПолучитьЗапретНаСменуНомеровБланковПослеВыбора();
	КонецЕсли;
	
	Если Статус<>Перечисления.СтатусыСертификатов._6  Тогда 
	элементы.НомерБланка.Доступность=ложь;
	иначе
	элементы.НомерБланка.Доступность=истина;
	конецесли;

	если не значениезаполнено(Подписант) Тогда
	Подписант=справочники.Пользователи.НайтиПоНаименованию("Смоленко И");
    конецесли;

	
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)
	
	
	ЗаполнитьЗначенияСвойств(СтруктураДанныхСертификатов,Этаформа)  ;
	ЭтаФорма.Закрыть(новый структура("Команда,ДанныеСертификата,Таблица","ок",СтруктураДанныхСертификатов,ЭкспертизаИСертификация.ТЧВМасивструктур(тнвед)));

	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	ЭтаФорма.Закрыть(новый структура("Команда","отмена"));
КонецПроцедуры

&НаКлиенте
Процедура ТНВЕДПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	макстр=0;
	для каждого сттнв из ТНВЕД цикл
		если   сттнв.НомерСтрок=0 тогда продолжить;КонецЕсли;
		макстр=макс(макстр,сттнв.НомерСтрок);
	конеццикла;
	
	Если НоваяСтрока тогда
		//Элемент.ТекущиеДанные.НомерСтрок=Элемент.ТекущаяСтрока+1 ;
		Элемент.ТекущиеДанные.НомерСтрок=макстр+1 ;
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ТНВЕДПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
элемент.ТекущиеДанные.ид=ид;	
КонецПроцедуры


&НаКлиенте
Процедура Подбор(Команда)
	ЗначениеОтбора = Новый Структура();
 //   ЗначениеОтбора.Вставить("Организация", Организация);
    ПараметрыВыбора = Новый Структура("ЗакрыватьПриВыборе, МножественныйВыбор, Отбор", Истина, Истина, ЗначениеОтбора);
    
    Оповещение = новый ОписаниеОповещения("ОбработатьПодборТнвед",ЭтаФорма);
    
    ОткрытьФорму("Справочник.КлассификаторТНВЭД.ФормаВыбора",ПараметрыВыбора,ЭтаФорма,,,,Оповещение);  //

КонецПроцедуры


&НаКлиенте
Процедура ОбработатьПодборТнвед(Рез,ДопПараметры) Экспорт
	Если рез=Неопределено тогда
		возврат;
	конецесли;
	для каждого ии из рез цикл
		стр=тнвед.Добавить();
		стр.ид=ид;
		стр.товар=ЭкспертизаИСертификация.ЗначениеРеквизитаОбъекта(ии,РеквизитПодбораТНВЕД);
		
	конеццикла;
	
	

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	//Вставить содержимое обработчика
КонецПроцедуры


&НаКлиенте
Функция УС(тхт)      // убратьсимволы
	
	тхт9=стрзаменить(тхт,Символ(11),символы.ВК);
	Возврат(сокрлп(стрзаменить(тхт9,Символ(7),""))) ;
	
КонецФункции


&НаКлиенте
Процедура Загрузить(Команда)
    


Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
// Задаем фильтр доступных расширений файлов для выбора
Диалог.Фильтр = "Файлы MS Word (*.doc;*.docx)|*.doc;*.docx";

Диалог.Заголовок = НСтр("ru=’Выберите файл шаблона для загрузки'");
// Создаем объект ОписаниеОповещения, который будет передан в метод Показать
ОповещениеЗавершения = Новый ОписаниеОповещения("ВыборФайлаЗавершение", ЭтотОбъект);
// Открываем окно выбора файла
Диалог.Показать(ОповещениеЗавершения);


    
КонецПроцедуры

&НаКлиенте
Процедура ВыборФайлаЗавершение(Результат, ДополнительныеПараметры) Экспорт
    Если Результат = Неопределено Тогда
        Возврат;
    КонецЕсли;
    
    ПутьКФайлу = Результат[0];
    ЗагрузитьизДокумента(ПутьКФайлу) ;
КонецПроцедуры



&НаКлиенте
Процедура ЗагрузитьизДокумента(имяфайла)
	
	Попытка
		
	
	 	 Wk = Новый COMОбъект("Word.Application"); 

	 
	 
	 
Wk.Visible = ложь; Wk.Documents.Open(имяфайла); 
Документ = Wk.ActiveDocument();


Исключение

	ПоказатьПредупреждение(Неопределено, "При открытии Word Application произошла ошибка. Проверьте правильность установки",10,"Ошибка загрузки шаблона");
	
	Возврат;
	КонецПопытки;



// перебирая строки выводим текст 
//
таб1=Документ.Content.Tables(1);
//таб2=Документ.Content.Tables(2);
//таб3=Документ.Content.Tables(3);


//Документ.Content.Tables(1).Cell(1, 1).Range.Text

Отправитель=УС(таб1.Cell(2,1).Range.Text);

//Экспортер=
Получатель=УС(таб1.Cell(4,1).Range.Text);
//Страназап = УС(таб1.Cell(4,2).Range.Text);

//страназап=ЭкспертизаИСертификация.НайтиСтранупоИмени(Страназап);
//Если ЗначениеЗаполнено(Страназап) тогда
//	Страна=Страназап;
//КонецЕсли;


//Импортер=
Маршрут=УС(таб1.Cell(6,1).Range.Text) ;

масивстрок=   СтрРазделить(Маршрут,Символы.ВК);


СлужебнаяОтметка=УС(таб1.Cell(6,2).Range.Text);
Транспорт="";


тнвед.Очистить();

для  ии=8   по 18 цикл
	
		//знч2=УС(таб1.Cell(ии,2).Range.Text);
		знч1=УС(таб1.Cell(ии,1).Range.Text);
		знч3=УС(таб1.Cell(ии,3).Range.Text);
		
		
если не ПустаяСтрока(знч1) и не ПустаяСтрока(знч3) тогда
стр=тнвед.Добавить();

стр.номерстрок=  сокрлп(стрзаменить(стрзаменить(таб1.Cell(ии,1).Range.Text,Символ(7),""),".",""));
стр.мест= УС(таб1.Cell(ии,2).Range.Text)    ;
стр.товар=УС(таб1.Cell(ии,3).Range.Text)    ;
стр.КритерийПроисхождения=УС(таб1.Cell(ии,4).Range.Text)    ;
стр.вес=УС(таб1.Cell(ии,5).Range.Text)    ;
стр.ид=ид;
если ии=8 тогда
Счетфактура=УС(таб1.Cell(ии,6).Range.Text) ;
КонецЕсли;

иначе
Прервать;

КонецЕсли;


конеццикла   ;

странас=УС(таб1.Cell(ии+2,2).Range.Text)   ;

ПодписантКонтрагента=УС(таб1.Cell(ии+3,2).Range.Text)    ;

ДатаДекларации=УС(таб1.Cell(ии+3,2).Range.Text)  +" 12:00:00"   ;












Документ.Close(); 
Wk.Quit();
КонецПроцедуры


&НаСервере
Процедура УстановитьСтусПроектНаСервере()

статус=Перечисления.СтатусыСертификатов._6;
	
КонецПроцедуры
	
&НаКлиенте
Процедура СтатусПриИзменении(Элемент)
	
	если Элемент.ТекстРедактирования<>"6   - проект"  тогда
	элементы.НомерБланка.Доступность=ложь;
	иначе
	элементы.НомерБланка.Доступность=истина;
	конецесли;
	
	 если Элемент.ТекстРедактирования="9   - аннулирован"  тогда
     УстановитьСтусПроектНаСервере();
     конецесли;
	 
	Если   НомерБланка=0   тогда
	УстановитьСтусПроектНаСервере();
	КонецЕсли;
	 
	 
КонецПроцедуры


